{
    "experiences": [
        {
            "title": "Test Automation Engineer",
            "subtitle": "Ford Motor Company",
            "workType": "Full-time",
            "workDescription": [
                "Proficient in test automation using Python, pytest, and the Slash framework.",
                "Extensive experience in multithreading for concurrent test execution.",
                "Strong knowledge of SSH and paramiko for secure remote connections.",
                "Skilled in testing embedded systems, including C++ components.",
                "Proficient in virtualization with VMs, particularly on Ubuntu and VirtualBox.",
                "Expertise in setting up and managing Jenkins pipelines for continuous integration.",
                "In-depth understanding of Linux-based systems and commands.",
                "Strong grasp of data structures and algorithms to optimize test cases.",
                "Adept at Object-Oriented Programming (OOP) principles for maintainable code.",
                "Proficient in networking concepts, essential for testing distributed systems.",
                "Experienced in writing Bash scripts for test environment setup and teardown.",
                "Skilled in API testing using tools like Postman for comprehensive validation.",
                "Utilizes fixtures to create consistent and reusable test setups.",
                "Demonstrated ability to test system integration with a focus on compatibility.",
                "Proficiency in utilizing SSH to access and test remote systems.",
                "Strong debugging skills to identify issues and provide detailed reports.",
                "Thorough understanding of version control systems, such as Git.",
                "Skilled in writing and maintaining documentation for test cases and procedures.",
                "Collaborative approach in cross-functional teams for testing objectives.",
                "Continuous improvement mindset, staying updated on industry best practices.",
                "Mentored and supported team members in test automation best practices.",
                "Conducted technical demos to illustrate testing procedures and tools to colleagues.",
                "Proficient in Functional Testing, ensuring software meets specified requirements.",
                "Conducted Sanity Testing to quickly verify basic functionality after changes.",
                "Experienced in Integration Testing to validate interactions between system components.",
                "Knowledgeable in Docker for containerization, streamlining the testing environment setup.",
                "Proficient in automating the deployment and management of test environments using Docker containers.",
                "Utilized Jira for issue tracking and Confluence for documentation of test cases and processes."
                
            ],
            "dateText": "12/2021 – Present"
        },
        {
            "title": "QA Automation Specialist",
            "subtitle": "Rockport Networks Inc.",
            "workType": "Full-time",
            "workDescription": [
                "Developed and executed automated test scripts using Python for networking software products",
                "Debugged test failures, worked closely with the Software Development Teams, and reported software bugs in JIRA bug tracking system",
                "Performed functional testing to ensure software products met customer requirements and standards",
                "Worked with developers to identify and troubleshoot defects and improve software quality",
                "Collaborated with cross-functional teams to ensure software products met performance and reliability standards",
                "Developed and maintained test plans, test cases, and test scripts to ensure comprehensive test coverage",
                "Supported our Dev-ops prime by triggering builds using Jenkins Pipeline",
                "Carried out Manual Testing with Linux Shell scripts",
                "Experience creating test suites using TestRail"

            ],
            "dateText": "05/2019 – 12/2021"
        },
        {
            "title": "Radio Software Tester",
            "subtitle": "Ericsson",
            "workType": "Internship",
            "workDescription": [
                "Integrated and verified new features on the Ericsson LTE network used by US Telecom operators",
                "Assessed the functionality of hardware devices using QXDM ProfessionalTM by Qualcomm",
                "Worked collaboratively in a cross-functional agile team consisting of system engineers",
                "Debugged a complex RF hardware Ericsson product used in lab nodal testing",
                "Ran TCL scripts to check for hardware and software system sanity status",
                "Working knowledge of UNIX, Windows and SHELL environments",
                "Monitored hardware device performance using Signal Analyzers"
            ],
            "dateText": "01/2018 – 08/2018"
        }
    ]
}